CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    init_memory_loggers();
    Serial.println("Initializing PMS5003 sensor");
    pms.init();
    delay(2000);
    pms.sleep();
    dht.setType(DHTTYPE);

    loadInitialConfigs(); // from global config file after compilation

    if (!LittleFS.begin(true))
    {
        Serial.println("An error has occurred while mounting LittleFS");
    }
    else
    {
        Serial.println("LittleFS mounted successfully");

        // Step 1: Load existing config from LittleFS // ToDo: Refactor this to a function and call it in the captive portal flow as well after user submits config form. This is to ensure that we always have the latest config in memory, especially after user updates it via captive portal.
        String existingConfig = readFile(LittleFS, "/config.json");
        if (existingConfig != "" && validateJson(existingConfig.c_str()))
        {
            Serial.println(existingConfig);
            DeviceConfigState.configurationRequired = false;
        }
        else
        {
            DeviceConfigState.configurationRequired = true;
        }
    }

    // Device configuration

    if (DeviceConfigState.configurationRequired)
    {
        // Step 2: Start WiFi AP
        WiFi.softAP(AP_SSID, AP_PWD);
        Serial.print("struct_wifiInfo* wifiInfo size: ");
        Serial.println(max_wifi_hotspots_size);

        wifi_networks_scan(wifiInfo, count_wifiInfo);

        // Step 3: Start Captive Portal & Web Server
        DeviceConfigState.state = CONFIG_CAPTIVE_PORTAL_ACTIVE;
        DeviceConfigState.captivePortalStartTime = millis();
        DeviceConfigState.captivePortalTimeoutMs = 5 * 60 * 1000; // 5 minutes
        // DNS server for captive portal
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        setup_webserver();

        // ToDO: Do not start captival portal if configs are valid
        // ToDo: This should probably be spinned in another core
        startCaptivePortal(DeviceConfigState.captivePortalAccessed, DeviceConfigState.captivePortalStartTime, DeviceConfigState.captivePortalTimeoutMs);
    }

    // ToDo: go ahead and apply device configs. Check the default power saving mode and set default configs.
    loadSavedDeviceConfigs(); // Override initial configs

    WiFi.softAP(AP_SSID, AP_PWD); // start AP & webserver anyway
    setup_webserver();

    // ToDo: Refactor the following logic to a function that checks the communication options in order of priority and connects to the available one. For example, if WiFi is available and has higher priority, connect to it. If not, check for GSM and connect to it if available. This will make the code cleaner and more maintainable, especially as we add support for more communication options in the future.

    if (DeviceConfig.useWiFi && CommunicationPriority::WIFI == 0)
    {
        if (DeviceConfig.wifi_sta_ssid[0] == '\0')
        {
            Serial.println("DeviceConfig wifi ssid empty!");
        }
        else
        {
            DeviceConfigState.state = ConfigurationState::CONFIG_WIFI;
            DeviceConfigState.wifiConnected = wifiConnect(DeviceConfig.wifi_sta_ssid, DeviceConfig.wifi_sta_pwd);

            // wifiConnect already checks for internet; record it for diagnostics
            DeviceConfigState.wifiInternetAvailable = DeviceConfigState.wifiConnected;
            DeviceConfigState.internetAvailable = DeviceConfigState.wifiInternetAvailable || DeviceConfigState.gsmInternetAvailable;

            if (DeviceConfigState.wifiConnected)
            {
                configDeviceFromWiFiConn();
            }
        }
    }

    if ((DeviceConfig.useGSM && CommunicationPriority::GSM == 0) || (!DeviceConfig.useWiFi || !DeviceConfigState.wifiConnected)) // ToDo: Only connect to GSM if WiFi is not connected or not prioritized or no WiFi internet during initialization.
    {
        if (GSM_Serial_begin())
        {

            if (!GSM_init())
            {
                Serial.println("GSM not fully configured");
                Serial.print("Failure point: ");
                Serial.println(GSM_INIT_ERROR);
                Serial.println();
                return;
            }
            else
            {
                GSM_CONNECTED = true;

                while (!register_to_network()) // ! INFINITE LOOP!
                {
                    Serial.println("Retrying network registration...");
                }

                gsm_info["Network Name"] = getNetworkName();
                gsm_info["Signal Strength"] = getSignalStrength();
                gsm_info["Network Band"] = getNetworkBand();
                gsm_info["SIM ICCID"] = SIM_CCID;

                // GPRS init
                if (!GPRS_init())
                {
                    Serial.println("Failed to init GPRS");
                }
                else
                {
                    Serial.println("GPRS initialized!");
                }

                if (getNetworkTime(time_buff))
                {

                    // update RTC time and calendar;
                    Serial.println("GSM Network Time: " + String(time_buff));
                    esp_datetime_tz = extractDateTime(String(time_buff));
                    RTC.setTime(esp_datetime_tz.timestamp);
                    initCalender(RTC.getYear(), RTC.getMonth() + 1);
                }
                else
                {
                    Serial.println("Failed to fetch time from network");
                }
            }

            captureGSMInfo();

            GSM_sleep();
        }
        else
        {
            Serial.println("Could not communicate to GSM module.");
        }
    }

    // else
    // {
    //     // connectWifi();
    //     Serial.println("Support for other network connections not yet implemented");
    // }

// SD INIT
#ifdef REASSIGN_PINS
    SPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (SD_Init(SD_CS))
    {
#else
    if (SD_Init(-1))
    {
#endif

        SD_Attached = SDattached();

        if (SD_Attached)
        {
            init_SD_loggers();
        }
    }

    starttime = millis();
}

// ToDo: introduce ESP light sleep mode
void loop()
{
#if defined(SERIAL_DEBUG) && SERIAL_DEBUG
    listenSerial();
#endif
    unsigned sum_send_time = 0;
    act_milli = millis();

