CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    if (DeviceConfig.power_saving_mode)
    {
        if (act_milli - last_read_sensors_data > sampling_interval && !send_now) // only send data after the memory logger is full
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
        }
    }
    else
    {
        send_now = act_milli - starttime > sending_intervall_ms;

        if (act_milli - last_read_sensors_data > sampling_interval)
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
        }
    }

    if (send_now)
    {

        if (!GPRS_CONNECTED)
        {
            GPRS_init();
        }
        else
        {

            // Send data from memory loggers
            sendFromMemoryLog(JSON_PAYLOAD_LOGGER);
            // send payloads from the files that stores data that failed posting previously
            readSendDelete(SENSORS_FAILED_DATA_SEND_STORE_PATH);

            // Serial.println("Time for Sending (ms): " + String(sum_send_time));

            // Serial.println("Sent data counts: " + count_sends);
            GSM_sleep();
        }

        starttime = millis();
    }

    if (millis() - boottime > DURATION_BEFORE_FORCED_RESTART_MS)
    {
        ESP.restart();
    }
}

void readDHT()
{

    delay(2000);
    char resultDHT[255] = {};
    Serial.print("Reading DHT22...");
    uint32_t start = millis();
    int chk = dht.read();
    uint32_t stop = millis();

    switch (chk)
    {
    case DHTLIB_OK:
    {
        uint32_t duration = stop - start;
        Serial.print("DHT read duration: ");
        Serial.println(duration);
        char buf[128] = {};
        float temperature = dht.getTemperature();
        float humidity = dht.getHumidity();
        String datetime = getRTCdatetimetz(ISO_time_format, esp_datetime_tz.timezone);
        sprintf(buf, "Temperature %0.1f C, Humidity %0.1f %% RH", temperature, humidity);

        Serial.println(buf);
        if (datetime != "")
        {
            updateCalendarFromRTC(); // In case we roll into a new year or month.
            // Generate JSON data
            JsonDocument DHT_data_doc;
            JsonArray DHT_data = DHT_data_doc.to<JsonArray>();
            add_value2JSON_array(DHT_data, "temperature", temperature);
            add_value2JSON_array(DHT_data, "humidity", humidity);
            // serializeJsonPretty(DHT_data_doc, Serial);
            generateJSON_payload(resultDHT, DHT_data_doc, datetime.c_str(), SensorAPI_PIN::DHT, sizeof(resultDHT));
            memoryDataLog(JSON_PAYLOAD_LOGGER, resultDHT);

            // Generate CSV data and log to memory
            generateCSV_payload(resultDHT, sizeof(resultDHT), datetime.c_str(), "temperature", temperature, "°C", "DHT22");
            generateCSV_payload(resultDHT, sizeof(resultDHT), datetime.c_str(), "humidity", humidity, "%", "DHT22");
            memoryDataLog(CSV_PAYLOAD_LOGGER, resultDHT);

            // update current sensor data
            JsonObject dht_obj = DHT_data_doc.to<JsonObject>();
            dht_obj["temperature"] = temperature;
            dht_obj["humidity"] = humidity;
            current_sensor_data["DHT"] = dht_obj;
            serializeJsonPretty(current_sensor_data, Serial);
        }

        break;
    }
    case DHTLIB_ERROR_CHECKSUM:
        Serial.print("Checksum error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_A:
        Serial.print("Time out A error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_B:
        Serial.print("Time out B error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_C:
        Serial.print("Time out C error,\t");
        break;
    case DHTLIB_ERROR_TIMEOUT_D:
        Serial.print("Time out D error,\t");
        break;
    case DHTLIB_ERROR_SENSOR_NOT_READY:
        Serial.print("Sensor not ready,\t");
        break;
    case DHTLIB_ERROR_BIT_SHIFT:
        Serial.print("Bit shift error,\t");
        break;
    case DHTLIB_WAITING_FOR_READ:
        Serial.print("Waiting for read,\t");
        break;
    default:
        Serial.print("Unknown: ");
        Serial.print(chk);
        Serial.print(",\t");
        break;
    }
}

void getPMSREADINGS()
{
    pms.wake();
    delay(30000); // wait for 30 seconds warm-up to get an accurate reading

    // pms.sleep();
    char result_PMS[255] = {};
    pms.read();
    if (pms) // Successfull read
    {
        pms.sleep();
        char read_time[32];
        String datetime = getRTCdatetimetz(ISO_time_format, esp_datetime_tz.timezone);

        // print the results
        printPM_values();

        if (datetime == "") // ! extra validation needed now that RTC is being used
        {
            Serial.println("Datetime is empty...discarding data point");
        }
        else
        {
            updateCalendarFromRTC(); // In case we roll into a new year or month.

            // Generate JSON data
            JsonDocument PM_data_doc;
            JsonArray PM_data = PM_data_doc.to<JsonArray>();

            add_value2JSON_array(PM_data, "P0", pms.pm01);
            add_value2JSON_array(PM_data, "P1", pms.pm10);
            add_value2JSON_array(PM_data, "P2", pms.pm25);

            // serializeJsonPretty(PM_data_doc, Serial);
            generateJSON_payload(result_PMS, PM_data_doc, datetime.c_str(), SensorAPI_PIN::PMS, sizeof(result_PMS));

            memoryDataLog(JSON_PAYLOAD_LOGGER, result_PMS);

            // Generate CSV data and log to memory

            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM0", pms.pm01, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);
            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM2.5", pms.pm25, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);
            generateCSV_payload(result_PMS, sizeof(result_PMS), datetime.c_str(), "PM10", pms.pm10, "ug/m3", "PMS");
            memoryDataLog(CSV_PAYLOAD_LOGGER, result_PMS);

