CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
    // close files
    closeFile(SD, datafile);
}

void updateCalendarFromRTC()
{
    bool calendarUpdated = false;
    int year = RTC.getYear();
    int month = RTC.getMonth() + 1; // ESP32Time month is 0 based

    if (year > current_year)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_year);
        Serial.print(" to: ");
        Serial.println(year);

        current_year = year;
        current_month = month; // Also update the month. Ideally, Jan.
        calendarUpdated = true;
    }
    else if (month > current_month)
    {
        Serial.print("Updating year from: ");
        Serial.print(current_month);
        Serial.print(" to: ");
        Serial.println(month);

        current_month = month;
        calendarUpdated = true;
    }
    if (calendarUpdated)
    {
        init_SD_loggers();
    }
}

void initCalender(int year, int month)
{
    Serial.print("Initializing calendar with year: ");
    Serial.print(year);
    Serial.print(" and month: ");
    Serial.println(month);
    if (year != 0 && month != 0)
    {
        current_year = year;
        current_month = month;
    }
}

/**
    @brief Log data to memory
    @param logger : logger to log the data to
    @param data : data to log
    @return : void
    @note : The function will log the data to the logger. If the logger is full, it will append the data to a file.
**/
void memoryDataLog(LOGGER &logger, const char *data)
{

    if (logger.log_count < logger.MAX_ENTRIES)
    {
        strcpy(logger.DATA_STORE[logger.log_count], data);
        Serial.println("Logged data: " + String(logger.DATA_STORE[logger.log_count]));
        logger.log_count++;
    }
    else
    {
        Serial.println("Logger data log count exceeded for " + String(logger.name));
        switch (logger.type)
        {
        case DATA_LOGGERS::JSON:
            // Append to JSON file
            fileDataLog(logger);
            send_now = true;
            break;
        case DATA_LOGGERS::CSV:
            fileDataLog(logger);
            resetLogger(logger);
            break;
        }
    }
}

/**
    @brief Log data to file
    @param logger : logger to log the data to
    @return : void
    @note : The function will log the data to the file. If the file is full, it will append the data to a new file.
**/
void fileDataLog(LOGGER &logger)
{
    Serial.println("Logging data to file: " + String(logger.path));
    for (int i = 0; i < logger.MAX_ENTRIES; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            appendFile(SD, logger.path, logger.DATA_STORE[i]);
        }
    }
}

/**
    @brief Reset logger
    @param logger : logger to reset
    @return : void
    @note : The function will reset the logger. It will clear the data store and set the log count to 0.
**/
void resetLogger(LOGGER &logger)
{
    logger.log_count = 0;
    memset(logger.DATA_STORE, 0, sizeof(logger.DATA_STORE));
}

/**
    @brief Send data from memory loggers
    @param logger : logger to send data from
    @return : void
    @note : The function will send the data from the logger. If the send fails, the data will be appended to a file for later sending.
**/
void sendFromMemoryLog(LOGGER &logger)
{
    for (int i = 0; i < logger.log_count; i++)
    {
        if (strlen(logger.DATA_STORE[i]) != 0)
        {
            JsonDocument doc;
            deserializeJson(doc, logger.DATA_STORE[i]); // Extract API_PIN from the JSON data
            int api_pin = doc["API_PIN"] | -1;
            if (api_pin != -1)
            {
                if (!sendData(logger.DATA_STORE[i], api_pin, HOST_CFA, URL_CFA))
                {
                    // Append to file for sending later
                    appendFile(SD, SENSORS_FAILED_DATA_SEND_STORE_PATH, logger.DATA_STORE[i]);
                }
            }

            memset(logger.DATA_STORE[i], '\0', 255);
        }
    }
    logger.log_count = 0;

    //? call resetLogger(logger) to reset the logger
    //? or just clear the memory
}

// Get current sensor data;

JsonDocument getCurrentSensorData()
{
    return current_sensor_data;
}

void captureGSMInfo()
{
    // ToDo: Reduce memory footprint by moving global gsm_info doc to  scoped local variable asyncwebserver
    gsm_info["Network Name"] = GSMRuntimeInfo.operator_name = getNetworkName();
    // gsm_info["Network Band"] = GSMRuntimeInfo.network_band = getNetworkBand();
    gsm_info["Signal Strength"] = GSMRuntimeInfo.signal_strength = getSignalStrength();
    strcpy(GSMRuntimeInfo.sim_ccid, SIM_CCID);
    gsm_info["SIM ICCID"] = GSMRuntimeInfo.sim_ccid;
    gsm_info["Model ID"] = GSMRuntimeInfo.model_id = getModelID();
    gsm_info["Firmware Version"] = GSMRuntimeInfo.firmware_version = getFirwmareVersion();
    gsm_info["IMEI"] = GSMRuntimeInfo.imei = getIMEI();
}

void configDeviceFromWiFiConn()
{

    captureWiFiInfo();

    // synchronise system clock over NTP
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    time_t now = time(nullptr);
    RTC.setTime(now);
    initCalender(RTC.getYear(), RTC.getMonth() + 1);
}

void captureWiFiInfo()
{
    wifi_info["SSID"] = WiFi.SSID();
    wifi_info["BSSID"] = WiFi.BSSIDstr();
    wifi_info["Signal Strength"] = WiFi.RSSI();
    wifi_info["IP Address"] = WiFi.localIP().toString();
}

void loadInitialConfigs()
{

#if defined(POWER_SAVING_MODE)
    DeviceConfig.power_saving_mode = POWER_SAVING_MODE;
#endif
#if defined(GSM_APN)
    DeviceConfig.gsm_apn = GSM_APN;
#endif
#if defined(GSM_APN_PWD)
    DeviceConfig.gsm_apn_pwd = GSM_APN_PWD;
#endif
#if defined(WIFI_STA_SSID)
    DeviceConfig.wifi_sta_ssid = WIFI_STA_SSID;
#endif
#if defined(WIFI_STA_PWD)
    DeviceConfig.wifi_sta_pwd = WIFI_STA_PWD;
#endif
#if defined(SIM_PIN)
    DeviceConfig.sim_pin = SIM_PIN;
#endif

    if (gsm_capable)
        DeviceConfig.useGSM = use_gsm;

    DeviceConfig.useWiFi = use_wifi;

    if (!DeviceConfig.useWiFi && !DeviceConfig.useGSM)
        DeviceConfigState.configurationRequired = true;

    // if (DeviceConfig.power_saving_mode)
    //     {
    //         sampling_interval = 15 * 60 * 1000; // 15 minutes
    //         sending_intervall_ms = 60 * 60 * 1000; // 1 hour
    //     }
    // else
    //     {
    //         sampling_interval = 1 * 60 * 1000; // 1 minute
    //         sending_intervall_ms = 5 * 60 * 1000; // 5 minutes
    //     }
}

void listenSerial()
{
    if (Serial.available() > 0)
    {
        String command = Serial.readStringUntil('\n');
        command.trim();

        if (command == "restart")
        {
            Serial.println("Restarting device...");
            ESP.restart();
        }
        else if (command == "sendNow")
        {
            Serial.println("Triggering data send...");
            send_now = true;
        }
        else if (command == "clearConfig")
        {
            Serial.println("Clearing device config...");
            deleteFile(LittleFS, "/config.json");
        }
        else
        {
            Serial.println("Unknown command: " + command);
        }
    }
}